---
kind: other
id: Methods.T:Autodesk.Revit.UI.ExternalCommandData
source: html/8ae54632-679d-2b51-a2d5-399c3c9c63a6.htm
---
# ExternalCommandData Methods

Causes the object to release immediately any resources it may be utilizing.